src/cf/InformationRegisters/УчастникиПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчастникиПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗамещающиеИПомощники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РабочиеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РабочиеГруппы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автоподстановка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияОзнакомления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияРегистрации</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УчастникиПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьУчастников(Процесс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.УчастникиПроцессов.СоздатьНаборЗаписей();
	Набор.Отбор.Процесс.Установить(Процесс);
	Набор.Прочитать();
	Возврат Набор.Выгрузить();
	
КонецФункции

// Записывает набор участников переданного процесса по переданной таблице участников.
//
// Параметры:
//   Процесс - БизнесПроцессСсылка - процесс, участников которого нужно записать.
//   ТаблицаИсточникОригинал - ТаблицаЗначений - участники, имена колонок соответствуют регистру.
//   Замещать - Булево - Истина, если набор следует записать с замещением.
//
Процедура ЗаписатьНаборПоПроцессу(Процесс, Знач ТаблицаИсточникОригинал, Замещать = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Процесс) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Процесс.Установить(Процесс);
	
	ТаблицаИсточник = ТаблицаИсточникОригинал.Скопировать();
	
	Если ТаблицаИсточник.Колонки.Найти("УдалитьОтметкиВремениИдентификаторНабораЗаписей") <> Неопределено Тогда
		ТаблицаИсточник.Колонки.Удалить("УдалитьОтметкиВремениИдентификаторНабораЗаписей");
	КонецЕсли;
	
	Если ТаблицаИсточник.Колонки.Найти("ИдентификаторОтметкиВремени") <> Неопределено Тогда
		ТаблицаИсточник.Колонки.Удалить("ИдентификаторОтметкиВремени");
	КонецЕсли;
	
	Для каждого ИсточникСтрока Из ТаблицаИсточник Цикл
		
		Если Не ЗначениеЗаполнено(ИсточникСтрока.Участник) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ИсточникСтрока.Участник) = Тип("СправочникСсылка.Пользователи") Тогда
			ИсточникСтрока.Участник = СотрудникиВызовСервера.ОсновнойСотрудникПользователя(ИсточникСтрока.Участник);
		КонецЕсли;
		
	КонецЦикла;
	
	ИменаКолонок = "";
	Для Каждого Стр Из ТаблицаИсточник.Колонки Цикл
		Если ИменаКолонок <> "" Тогда
			ИменаКолонок = ИменаКолонок + ", ";
		КонецЕсли;	
		ИменаКолонок = ИменаКолонок + Стр.Имя;
	КонецЦикла;	
	ТаблицаИсточник.Свернуть(ИменаКолонок);
	
	Для каждого ИсточникСтрока Из ТаблицаИсточник Цикл
		
		Если Не ЗначениеЗаполнено(ИсточникСтрока.Участник) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ИсточникСтрока);
		Запись.Процесс = Процесс;
		
	КонецЦикла;
	
	Набор.Записать(Замещать);
	
	ИнтеграцияЗадач.ПриИзмененииПравИсточника(Процесс);
	
КонецПроцедуры

Процедура ОбновитьВсеДанные() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		Набор = РегистрыСведений.УчастникиПроцессов.СоздатьНаборЗаписей();
		Набор.Записать();
		
		ШаблонТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1000
			|	ТаблицаПроцесса.Ссылка
			|ИЗ
			|	БизнесПроцесс.%ИмяПроцесса% КАК ТаблицаПроцесса
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиПроцессов КАК УчастникиПроцессов
			|		ПО ТаблицаПроцесса.Ссылка = УчастникиПроцессов.Процесс
			|ГДЕ
			|	УчастникиПроцессов.Процесс ЕСТЬ NULL
			|	И НЕ ТаблицаПроцесса.Ссылка В (&МассивИсключений)";
			
		МассивИсключений = Новый Массив;
		ТаблицаНабора = РегистрыСведений.УчастникиПроцессов.СоздатьНаборЗаписей().ВыгрузитьКолонки();
			
		Для Каждого МетаданныеПроцесса Из Метаданные.БизнесПроцессы Цикл
			
			РезультатПустой = Ложь;
			Пока Не РезультатПустой Цикл
				
				Запрос = Новый Запрос(СтрЗаменить(ШаблонТекстаЗапроса, "%ИмяПроцесса%", МетаданныеПроцесса.Имя));
				Запрос.УстановитьПараметр("МассивИсключений", МассивИсключений);
				Результат = Запрос.Выполнить();
				РезультатПустой = Результат.Пустой();
				
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					ПроцессСсылка = Выборка.Ссылка;
					ПроцессОбъект = ПроцессСсылка.ПолучитьОбъект();
					
					ТаблицаНабора.Очистить();
					
					ЕстьУчастники = Ложь;
					Участники = ПраваДоступаНаБизнесПроцессы.ПолучитьТаблицуУчастниковПроцесса(ПроцессОбъект);
					Для Каждого Участник Из Участники Цикл
						ЕстьУчастники = ЗначениеЗаполнено(Участник.Участник);
						Запись = ТаблицаНабора.Добавить();
						ЗаполнитьЗначенияСвойств(Запись, Участник);
						Запись.Процесс = ПроцессСсылка;
					КонецЦикла;
					
					СоставРГ = РегистрыСведений.РабочиеГруппы.ПолучитьУчастниковПоОбъекту(ПроцессСсылка);
					Для Каждого СтрокаРГ Из СоставРГ Цикл
						ЕстьУчастники = ЗначениеЗаполнено(СтрокаРГ.Участник);
						Запись = ТаблицаНабора.Добавить();
						ЗаполнитьЗначенияСвойств(Запись, СтрокаРГ);
						Запись.Процесс = ПроцессСсылка;
					КонецЦикла;
					
					ТаблицаНабора.Свернуть("Процесс, Участник");
					РегистрыСведений.УчастникиПроцессов.ЗаписатьНаборПоПроцессу(ПроцессСсылка, ТаблицаНабора, Ложь);
					
					Если Не ЕстьУчастники Тогда
						МассивИсключений.Добавить(ПроцессСсылка);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
